app/controllers/adopcions_controller.rb

  def index
    @adopcions = Adopcion.all
---
SELECT "adopcions".* FROM "adopcions" ORDER BY "adopcions"."created_at" DESC

  def create
    @adopcion = Adopcion.new(adopcion_params)

    respond_to do |format|
      if @adopcion.save
---
INSERT INTO "adopcions" ("nombre", "tamanio", "edad", "ubicacion", "raza", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["nombre", ""], ["tamanio", nil], ["edad", nil], ["ubicacion", ""], ["raza", ""], ["created_at", "2023-11-09 15:56:16.771903"], ["updated_at", "2023-11-09 15:56:16.771903"]]

  def destroy
    @adopcion.destroy
---
DELETE FROM "adopcions" WHERE "adopcions"."id" = ?  [["id", 1]]

    def set_adopcion
      @adopcion = Adopcion.find(params[:id])
---
SELECT "adopcions".* FROM "adopcions" WHERE "adopcions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]