app/controllers/campanas_controller.rb

SELECT "campanas".* FROM "campanas" ORDER BY "campanas"."created_at" DESC
---
  def index
    @campanas = Campana.all

INSERT INTO "campanas" ("nombre_campana", "objetivo", "monto", "dni_titular_responsable", "created_at", "updated_at", "fecha_fin") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @campana = Campana.new(campana_params)

    respond_to do |format|
      if @campana.save

UPDATE "campanas" SET "updated_at" = ? WHERE "campanas"."id" = ?  [["updated_at", "2023-11-09 14:46:36.089005"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @campana.update(campana_params)