app/controllers/cuidadores_controller.rb

  def show
    @cuidador = Cuidador.find(params[:id])
---
SELECT "cuidadors".* FROM "cuidadors" WHERE "cuidadors"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def index
   # Aquí recuperas la lista de cuidadores de perros desde la base de datos.
   @cuidadores = Cuidador.all
---
SELECT "cuidadors".* FROM "cuidadors" ORDER BY "cuidadors"."created_at" DESC

  def create
    @cuidador = Cuidador.new(cuidador_params)

  if @cuidador.save
---
INSERT INTO "cuidadors" ("nombre", "apellido", "horarios", "ubicacion", "contacto", "created_at", "updated_at", "email") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

def contactar
 @cuidador = Cuidador.find(params[:id])
---
SELECT "cuidadors".* FROM "cuidadors" WHERE "cuidadors"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

def enviar_contacto
  @cuidador = Cuidador.find(params[:id])

  if user_signed_in?
    @solicitud = Solicitud.new(solicitud_params)
    @solicitud.user = current_user
  else
    @solicitud = Solicitud.new(solicitud_params)
  end

  if @solicitud.save
---
SELECT "cuidadors".* FROM "cuidadors" WHERE "cuidadors"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
INSERT INTO "solicituds" ("nombre", "email", "mensaje", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)