app/controllers/encontrados_controller.rb

SELECT "encontrados".* FROM "encontrados" ORDER BY "encontrados"."created_at" DESC
---
    def index
     @encontrados=Encontrado.all

SELECT "encontrados".* FROM "encontrados" WHERE "encontrados"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
    @encontrado= Encontrado.find(params[:id])

INSERT INTO "encontrados" ("nombre", "tamano", "ubicacion", "raza", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["nombre", "Pipe"], ["tamano", 30], ["ubicacion", "120 y 94"], ["raza", "dogo"], ["created_at", "2023-11-09 23:46:02.522649"], ["updated_at", "2023-11-09 23:46:02.522649"], ["user_id", 3]]
---
    def create
      @encontrado = Encontrado.new(encontrado_params)
      if @encontrado.save