app/controllers/main_controller.rb

SELECT "cuidadors".* FROM "cuidadors"
---
  def home
    @cuidadores = Cuidador.all