app/controllers/paseadores_controller.rb

  def index
   # Aquí recuperas la lista de cuidadores de perros desde la base de datos.
   @paseadores = Paseador.all
---
SELECT "paseadors".* FROM "paseadors" ORDER BY "paseadors"."created_at" DESC

  def create
    @paseador = Paseador.new(paseador_params)
    if @paseador.save
---
INSERT INTO "paseadors" ("nombre", "apellido", "horarios", "ubicacion", "contacto", "created_at", "updated_at", "email") VALUES (?, ?, ?, ?, ?, ?, ?, ?)