app/controllers/perdidos_controller.rb

   def index
    @perdidos=Perdido.all.order(created_at: :desc)
---
SELECT "perdidos".* FROM "perdidos" ORDER BY "perdidos"."created_at" DESC

   def show
    @perdido= Perdido.find(params[:id])
---
SELECT "perdidos".* FROM "perdidos" WHERE "perdidos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

   def encontrar
      @perdido = Perdido.find(params[:id])
     @perdido.update_column(:estado, 'Encontrado')
---
UPDATE "perdidos" SET "updated_at" = ? WHERE "perdidos"."id" = ?  [["updated_at", "2023-11-09 18:39:06.227706"], ["id", 1]]

   def create
      @perdido = Perdido.new(perdido_params.merge(estado: "perdido"))
      if @perdido.save
---
INSERT INTO "perdidos" ("nombre", "tamano", "edad", "ubicacion", "raza", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["nombre", "Pepo"], ["tamano", 120], ["edad", 12], ["ubicacion", "120 y 94"], ["raza", "dogo"], ["created_at", "2023-11-09 18:39:06.163092"], ["updated_at", "2023-11-09 18:39:06.163092"]]