app/models/adopcion.rb

  def validacion_perros_no_repetidos
    # Se asume que `autor_id` es un atributo en la instancia de `Perdido`
    if User.find(user_id).adopcions.exists?(nombre: nombre)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "adopcions" WHERE "adopcions"."user_id" = ? AND "adopcions"."nombre" = ? LIMIT ?  [["user_id", 1], ["nombre", "ralph"], ["LIMIT", 1]]