app/models/encontrado.rb

    def validacion_perros_no_repetidos
    if Encontrado.exists?(nombre: nombre, tamano: tamano, raza: raza, ubicacion: ubicacion)
---
SELECT 1 AS one FROM "encontrados" WHERE "encontrados"."nombre" = ? AND "encontrados"."tamano" = ? AND "encontrados"."raza" = ? AND "encontrados"."ubicacion" = ? LIMIT ?  [["nombre", "Pepo"], ["tamano", 25], ["raza", "mestizo"], ["ubicacion", "San Carlos"], ["LIMIT", 1]]