app/models/encontrado.rb

    def validacion_perros_no_repetidos
    # Se asume que `autor_id` es un atributo en la instancia de `Perdido`
    if User.find(user_id).encontrados.exists?(nombre: nombre)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT 1 AS one FROM "encontrados" WHERE "encontrados"."user_id" = ? AND "encontrados"."nombre" = ? LIMIT ?  [["user_id", 3], ["nombre", "Pipe"], ["LIMIT", 1]]