app/models/perdido.rb

SELECT 1 AS one FROM "perdidos" WHERE "perdidos"."nombre" = $1 AND "perdidos"."tamano" IS NULL AND "perdidos"."edad" IS NULL AND "perdidos"."raza" = $2 AND "perdidos"."ubicacion" = $3 LIMIT $4  [["nombre", "wefargsdhgfhfgjghjghjghjghjjdghjghjgjdgj"], ["raza", ""], ["ubicacion", ""], ["LIMIT", 1]]
---
  def validacion_perros_no_repetidos
    if Perdido.exists?(nombre: nombre, tamano: tamano, edad: edad, raza: raza, ubicacion: ubicacion)