app/views/layouts/application.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
          <% if user_signed_in?%>
            <p class="text-black"> Perfil: <%= link_to User.find(current_user.id).email, usuario_path(current_user) %></p>